In [2]:
import pandas as pd
#Empty DataFrame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
emp=pd.Series(['Parker','John','william'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'ID':id}

result=pd.DataFrame(frame)
print("\nseries to Data frame\n")
print(result)

series to Data frame

       Emp   ID
0   Parker  102
1     John  107
2  william  109
3      NaN  114

In [7]:
print("nAdding new coloumn:\n")
result['Age']=pd.Series([35,24,40,38])
print(result)

nAdding new coloumn:

       Emp   ID  Age
0   Parker  102   35
1     John  107   24
2  william  109   40
3      NaN  114   38

In [8]:
print("nDeleting one coloumn:\n")
del result['Age']
print(result)

nDeleting one coloumn:

       Emp   ID
0   Parker  102
1     John  107
2  william  109
3      NaN  114

In [9]:
print("\nExtracting the thirds row:\n")
print(result.loc[2])

Extracting the thirds row:

Emp    william
ID         109
Name: 2, dtype: object

In [19]:
d2=pd.DataFrame([['Dale',123],['Mark',143]],columns=['emp','Id'])
print("\nAdding new row values:\n",pd.concat([result,d2]))

Adding new row values:
        Emp     ID   emp     Id
0   Parker  102.0   NaN    NaN
1     John  107.0   NaN    NaN
2  william  109.0   NaN    NaN
3      NaN  114.0   NaN    NaN
0      NaN    NaN  Dale  123.0
1      NaN    NaN  Mark  143.0

In [20]:
print("\nDeleting particular row:\n",result.drop(1))

Deleting particular row:
        Emp   ID
0   Parker  102
2  william  109
3      NaN  114